pos_neg_categories = {
    "긍정": {
        "기쁨/행복": ["기쁨", "신이 난"],
        "감사": ["감사하는"],
        "신뢰": ["신뢰하는"],
        "자신감": ["자신하는"],
        "편안/느긋": ["편안한", "느긋"],
        "만족": ["만족스러운"],
        "흥분/열정": ["흥분"],
        "안도": ["안도"]
    },
    "부정": {
        # 1) "분노/짜증"에 "구역질 나는", "혐오스러운" 추가
        "분노/짜증": [
            "분노", "툴툴대는", "짜증내는", "방어적인", "악의적인", 
            "안달하는", "노여워하는", "성가신", "질투하는", "억울한",
            "구역질 나는",      # (7)
            "혐오스러운"        # (47)
        ],
        "슬픔": [
            "슬픔", "비통한", "우울한", "마비된", "눈물이 나는", "가난한 불우한"
        ],
        "불안/두려움": [
            "불안", "두려운", "스트레스 받는", "취약한", 
            "걱정스러운", "조심스러운", "초조한"
        ],
        "당혹/충격": [
            "혼란스러운", "당혹스러운", "충격 받은", 
            "당황", "고립된(당황한)", "혼란스러운(당황한)"
        ],
        "수치심/죄책감": [
            "후회되는", "남의 시선을 의식하는", "열등감", 
            "죄책감의", "부끄러운", "한심한"
        ],
        "절망/좌절/환멸": [
            "좌절한", "실망한", "염세적인", "낙담한", 
            "환멸을 느끼는", "회의적인"
        ],
        "상처/배신": [
            "상처", "배신당한", "희생된", "괴로워하는"
        ],
        "외로움/고립": [
            "고립된", "버려진", "외로운"
        ]
    }
}

